public class FileNavigator {

    public static void add() {}
    /*
Этот метод добавляет файл по указанному пути.
Если путь уже существует, новый файл необходимо добавить в список, уже связанный с соответствующим путем.
ВАЖНО: Путь - уникальное значение и не должно повторяться.
--------------
Реализовать проверку консистентности в методе add в классе FileNavigator.
     */

    public static void find() {}
    /*
Метод возвращает список файлов, связанных с путем переданным как параметр.
     */

    public static void filterBySize() {}
    /*
Метод возвращает список файлов, размер (в байтах) которых не превышает значение, переданное как параметр.
     */

    public static void remove() {}
    /*
Метод удаляет путь и связанные с ним файлы, исходя из значения пути, переданного как параметр.
     */

    public static void sortBySize() {}
    /*
Метод сортирует все имеющиеся файлы по размеру (по возрастанию), затем возвращает список отсортированных файлов.
     */

}
